var sub = {
	"-1": "Поможет скрыть твою личность, но за это копы могут и штрафануть",
    "-3": "Надеваются на руки, будешь как Елена летучаяя в шоу ревизорро!",
    "-4": "Это не те за 40 гривен, но тоже крутые",
    "-5": "Рюкзак.",
    "-6": "Стильно, модно, молодежно, а главное удобные поэтому береги их",
    "-7": "Для деловых встреч самое то",
    "-8": "Можно одеть под куртку, чтобы не было холодно",
    "-9": "Поможет получать меньже урона от выстрела",
    "-10": ".",
    "-11": "Стиль это про нее",
    "-12": "Можно надеть на голову",
    "-13": "От солнца иногда могут помочь",
    "-14": "Часы или Брелки на руку.",
    "-20": "Вы можете одеть его и храть в нем вещи",
    1: "Очень сильная штучка, может возродить человека",
    2: "Поможет заправить транспорт в любом месте",
    3: "Неплохо пополняет голод, когда хочеться есть",
    4: "Ты такое нигде не найдешь",
    5: "Поможет восстановить голод",
    6: "Поможет восстановить голод",
    7: "Поможет восстановить голод",
	8: "Поможет восстановить голод",
	9: "Поможет восстановить жажду",
	10:	"Поможет восстановить жажду",
	11:	"Нужна для вскрытия замка",
	12:	"Скорее всего деньги ворованые",
	13:	"Помогут скрафтить оружие во фракции",
	14:	"Наркотики, могут помочь, но для этого нужен бонг",
	15:	"Поможет вскрыть хранилище в банках",
	16:	"Поможет скрыть военую технику",
	17:	"Надев его на человека он не будет видеть",
	18:	"Помогут связать человека",
	19:	"Помогут открыть ваше личное ТС",
	20:	"Даёт алкогольный эффект",
	21:	"Даёт алкогольный эффект",
	22:	"Даёт алкогольный эффект",
	23:	"Даёт алкогольный эффект",
	24:	"Даёт алкогольный эффект",
	25:	"Даёт алкогольный эффект",
	26:	"Даёт алкогольный эффект",
	27:	"Даёт алкогольный эффект",
	28:	"Даёт алкогольный эффект",
	42:	"Сможет починить ваш транспорт",
	
	100: "Пистолет стреляет пулями 9x19mm",
    101: "Пистолет стреляет пулями 9x19mm",
    102: "Пистолет стреляет пулями 9x19mm",
    103: "Пистолет стреляет пулями 9x19mm",
    104: "Пистолет стреляет пулями 9x19mm",
    105: "Пистолет стреляет пулями 9x19mm",
    106: "Пистолет стреляет пулями 9x19mm",
    107: "Пистолет стреляет пулями 357 Magnum 9x32",
    108: "Пистолет стреляет пулями 9x19mm",
    109: "Бьёт больно",
    110: "Пистолет стреляет пулями 9x19mm",
    111: "Пистолет стреляет пулями 9x19mm",
    112: "Пистолет стреляет пулями 9x19mm",
    113: "Пистолет стреляет пулями 9x19mm",
    114: "Пистолет стреляет пулями 357 Magnum 9x32",

    115: "Пистолет-пулемет стреляет пулями 40ACP",
    116: "Пистолет-пулемет стреляет пулями 40ACP",
    117: "Пистолет-пулемет стреляет пулями 40ACP",
    118: "Пистолет-пулемет стреляет пулями 62x39mm",
    119: "Пистолет-пулемет стреляет пулями 40ACP",
    120: "Пистолет-пулемет стреляет пулями 62x39mm",
    121: "Пистолет-пулемет стреляет пулями 62x39mm",
    122: "Пистолет-пулемет стреляет пулями 9x19mm",
    123: "Пистолет-пулемет стреляет пулями 40ACP",
    124: "Пистолет-пулемет стреляет пулями 40ACP",
    125: "Пистолет-пулемет стреляет пулями 62x39mm",

    126: "Автомат стреляет пулями 62x39mm",
    127: "Автомат стреляет пулями 56x45mm",
    128: "Автомат стреляет пулями 62x39mm",
    129: "Автомат стреляет пулями 56x45mm",
    130: "Автомат стреляет пулями 62x39mm",
    131: "Автомат стреляет пулями 62x39mm",
    132: "Автомат стреляет пулями 62x39mm",
    133: "Автомат стреляет пулями 56x45mm",
    134: "Автомат стреляет пулями 56x45mm",
    135: "Автомат стреляет пулями 62x39mm",

    136: "Винтовка стреляет пулями 12ga Rifles",
    137: "Винтовка стреляет пулями 12ga Rifles",
    138: "Винтовка стреляет пулями 12ga Rifles",
    139: "Винтовка стреляет пулями 12ga Rifles",
    140: "Винтовка стреляет пулями 12ga Rifles",

    141: "Дробовик стреляет пулями 50BMG",
    142: "Дробовик стреляет пулями 50BMG",
    143: "Дробовик стреляет пулями 50BMG",
    144: "Дробовик стреляет пулями 50BMG",
    145: "Дробовик стреляет пулями 50BMG",
    146: "Дробовик стреляет пулями 12ga Buckshots",
    147: "Дробовик стреляет пулями 50BMG",
    148: "Дробовик стреляет пулями 50BMG",
    149: "Дробовик стреляет пулями 50BMG",

    180: "Может и убить человека",
    181: "Для игры в бейсбол, но и в лецо прилетит",
    182: "Рвашан еще не все гвозди забил",
    183: "Битой и убить можно",
    184: "Скользкая штучка, бандитам пойдет",
    185: "Поиграем в гольф?",
    186: "Можно и посадить гопников на нее",
    187: "Это типо от самурая",
    188: "Может рубить деревья",
    189: "Холодное оружие",
    190: "Резать арбузы пойдет",
    191: "Может открыть путь ночью",
    192: "Такой же надежный как часы",
    193: "Холодной оружие",
    194: "Просто ключик",
    195: "Для плохих делишек",

    200: "Хоть и маленькие, но больные",
    201: "Пистолет заряжется как раз ими",
	2201: "Засадишь в голову - он труп",
    202: "Среднячок, пойдет",
    203: "Большое оружие, большие патроны",
    204: "Дроби для дробовика",
    244: "Эти патроны для самой любимой пушки в гетто",
    245: "Государственные патроны, могут и убить сразу",
	
	205: "Нужна для ловли рыбы",
	206: "Нужна для ловли рыбы",
	207: "Нужна для ловли рыбы",
    208: "Нужна, чтобв приманить рыбу",
    209: "Корюшка, можно поймать на точках рыбалки",
    210: "Кунджа, можно поймать на точках рыбалки",
    211: "Лосось, можно поймать на точках рыбалки",
    212: "Окунь, можно поймать на точках рыбалки",
    213: "Осётр, можно поймать на точках рыбалки",
    214: "Скат, можно поймать на точках рыбалки",
	215: "Тунец, можно поймать на точках рыбалки",
	216: "Угорь, можно поймать на точках рыбалки",
	217: "Чёрный амур, можно поймать на точках рыбалки",
	218: "Щука, можно поймать на точках рыбалки",
	
	199: "В нём хранится сюрприз.",
	224: "Нужны для игры в казино",
	
	1000: "Его можно собрать в лесу взяв задание у деда",
	1001: "Его можно собрать в лесу взяв задание у деда",
	1002: "Его можно собрать в лесу взяв задание у деда",
	1003: "Его можно собрать в лесу взяв задание у деда",
	1004: "Его можно собрать в лесу взяв задание у деда",
	1005: "Его можно собрать в лесу взяв задание у деда",
	1006: "Его можно собрать в лесу взяв задание у деда",
	1007: "Очень редкий гриб, в лесу можно найти",
	8000: "Можешь поиграть в нем в Brawl Stars",
	
	43: "Оружие для вандалов, как говорит моя бабуля",
	570: "Сможет повысить тебе здоровье на 25 едениц",
	569: "Сможет повысить тебе здоровье на 70 едениц", 
	576: "Хакерская штучка, не знаешь как пользоваться, выкинь",
	
	10501:	"Это настоящяя белоруская картошка",
	10502:	"Много есть будешь, будешь здоровым",
	10503:	"Можно продать скупщику",
	10504:	"Может принести удачу, а может и обмануть",
	10505:	"Можно продать скупщику и получить деньги",

	10506:	"Можешь посадить на ферме",
	10507:	"Можешь посадить на ферме",
	10508:	"Можешь посадить на ферме",
	10509:	"Можешь посадить на ферме",
	500: "Не дешевая и шпионская штучка, для управления доступа только государству",
	227: "Спомощью него можно шпионить за людьми",
	562: "Это можно поставить на свою тачку",
	565: "С помощью рации можно общаться на расстоянии, только настройте волну",
	566: "Можно вылечить человека если вы работаете доктором",
	567: "Уже использованная таблетка, просто мусор, можно сдать на переработку",
	568: "Очень длинная и розовая штука, если попадет в кое-какую дырку, уже не вылезет",
	571: "Очень длинная и черная штука, если попадет в кое-какую дырку, уже не вылезет",
	572: "Очень длинная и красная штука, если попадет в кое-какую дырку, уже не вылезет",
	573: "Для того чтобы закуриться, нужно иметь наркотики и зажигалку",
	575: "Для того чтобы закуриться, нужно иметь наркотики и зажигалку",
	574: "Зажигалка, нужна для взаимодействия с другими предметами, но главное не сгореть!",
	580: "На нем можно кататься зимой по горам и специальным местам",
	
	600: "Мебель, которую скорее всего вытащили из дома не честным путем",
	601: "Мебель, которую скорее всего вытащили из дома не честным путем",
	602: "Мебель, которую скорее всего вытащили из дома не честным путем",
	609: "Ограбленные деньги, скорее всего получили не очень честным путем",
	610: "Можно поставить на пол и включить свою любимую музыку!",
	611: "Ей можно копать снег",
	612: "Материал, из которого можно лепить снежки, снеговиков и иглы",
}
var itemsData = {
    "-1": "Маска",
    "-3": "Перчатки",
    "-4": "Низ",
    "-5": "Рюкзак",
    "-6": "Обувь",
    "-7": "Аксессуар",
    "-8": "Майка",
    "-9": "Бронежилет",
    "-10": "Украшения",
    "-11": "Верх",
    "-12": "Головной убор",
    "-13": "Очки",
    "-14": "Аксессуар",
    "-20": "Рюкзак",
    1: "Эпинефрин",
    2: "Канистра",
    3: "Пачка чипсов",
    4: "Pißwasser",
    5: "Кусок пиццы",
    6: "Бургер",
    7: "Хот-Дог",
    8: "Сэндвич",
    9: "eCola",
    10: "Спрайт",
    11: "Отмычка для замков",
    12: "Сумка с деньгами",
    13: "Материалы",
    14: "Наркотики",
    15: "Сумка с дрелью",
    16: "Военная отмычка",
    17: "Мешок",
    18: "Стяжки",
    19: "Ключи от машины",
    40: "Подарок",
    41: "Связка ключей",
	43: "Балончик",

    20: "На корке лимона",
    21: "На бруснике",
    22: "Русский стандарт",
    23: "Асахи",
    24: "Cherenkov",
    25: "Jack Janiel",
    26: "Champagne Bleuter'd",
    27: "Самбука",
    28: "Кампари",
    29: "Дживан",
    30: "Арарат",
    31: "Ноян Тапан",

    100: "Пистолет",
    101: "Боевой пистолет",
    102: "Пистолет .50",
    103: "Пистолет SNS",
    104: "Тяжелый пистолет",
    105: "Винтажные пистолет",
    106: "Пистолет-стрелок",
    107: "Револьвер",
    108: "Пистолет AP",
    109: "Электрошокер",
    110: "Ракетница",
    111: "Двойное действие",
    112: "Пистолет MK2",
    113: "Карманный пистолет",
    114: "Револьвер MK2",

    115: "Микро ПП",
    116: "Пистолет-пулемет",
    117: "ПП",
    118: "Штурмовой ПП",
    119: "Боевой PDW",
    120: "Пулемет",
    121: "Боевой Пулемет",
    122: "Автомат Томпсона",
    123: "Мини ПП",
    124: "ПП MK2",
    125: "Боевой пулемет MK2",

    126: "Штурмовая винтовка",
    127: "Карабиновая винтовка",
    128: "Продвинутая винтовка",
    129: "Специальный карабин",
    130: "Винтовка Буллпап",
    131: "Компактная винтовка",
    132: "Штурмовая винтовка MK2",
    133: "Карабиновая Винтовка MK2",
    134: "Специальный карабин MK2",
    135: "Винтовка Буллпап MK2",

    136: "Снайперская винтовка",
    137: "Тяжелая снайперская винтовка",
    138: "Стрелковая винтовка",
    139: "Тяжелая снайперская винтовка MK2",
    140: "Стрелковая винтовка MK2",

    141: "Помповый дробовик",
    142: "Обрез",
    143: "Дробовик Буллпап",
    144: "Штурмовой Дробовик",
    145: "Мушкет",
    146: "Тяжклый дробовик",
    147: "Двуствольный дробовик",
    148: "Подметальный дробовик",
    149: "Помповый дробовик MK2",

    180: "Нож",
    181: "Дубинка",
    182: "Молоток",
    183: "Бита",
    184: "Лом",
    185: "Гольф клюшка",
    186: "Бутылка",
    187: "Кинжал",
    188: "Топор",
    189: "Кастет",
    190: "Мачете",
    191: "Фонарик",
    192: "Швейцарский нож",
    193: "Кий",
    194: "Ключ",
    195: "Боевой топор",
	
	199: "Подарок",

    200: "Патроны 45ACP",
    201: "Патроны 9x19mm",
	2201: "Патроны Magnum 9x32",
    202: "Патроны 62x39mm",
    203: "Патроны 12ga Buckshots",
    204: "Патроны 50BMG",
    244: "Патроны 12ga Rifles",
    245: "Патроны 56x45mm",
	
	// Fishing
	205: "Удочка",
	206: "Улучшенная удочка",
	207: "Удочка MK2",
    208: "Наживка",
    209: "Корюшка",
    210: "Кунджа",
    211: "Лосось",
    212: "Окунь",
    213: "Осётр",
    214: "Скат",
	215: "Тунец",
	216: "Угорь",
	217: "Чёрный амур",
	218: "Щука",
	
	236: "Апельсин",
	219: "Урожай",
	220: "Семена",
	
	// Repair
	42: "Инструменты",
	
	570: "Бинт",
	569: "Аптечка", 
	
	//Farm
	255: "Листья коки",

    224: "Фишки",
	
	//Diver
	256: "Золото",
	257: "Железяка",
	
	//New year
	258: "Снежок",
    576: "Программатор",
	
	1000: "Гриб",
	1001: "Гриб",
	1002: "Мухамор",
	1003: "Гриб",
	1004: "Гриб",
	1005: "Гриб",
	1006: "Гриб",
	1007: "Золотой гриб",
	8000: "Телефон",
	
	2219: "Листья коки",
	2220: "Красный лед",
	2221: "Кокаин",
	3222: "Героин",
	
	10501:	"Картофель",
	10502:	"Капуста",
	10503:	"Пшеница",
	10504:	"Клевер",
	10505:	"Молоко",

	10506:	"Семена картофеля",
	10507:	"Семена капусты",
	10508:	"Семена пшеницы",
	10509:	"Семена клевера",
	
	227: "Бинокль",
	500: "Дрон",
	562: "Номера авто",
	565: "Рация",
	566: "Таблетка",
	567: "Пустая таблетка",
	568: "Розовое дилдо",
	571: "Черное дилдо",
	572: "Красное дилдо",
	573: "Бонг",
	574: "Зажигалка",
	575: "Разноцветный бонг",
	580: "Сноуборд Burton",
	
	600: "Туалет",
	601: "Растение",
	602: "Пуфик",
	603: "Леденцы",
	609: "Ограбленные деньги",
	610: "Бумбокс",
	611: "Лопатка",
	612: "Снег",
	613: "Снежная фигура 1",
	614: "Снежная фигура 2",
	615: "Иглу",
}
Vue.component('item', {
    template: '<div class="item draggable" :class="items" :id="ids" :data-type="typ" v-bind:weight="(weight*count).toFixed(2)" :fastslot="fast_slot" :data-active="ativ" @click.right.prevent="select">\
    <img :src="src" onerror="imgError(this);"><div class="coint">{{count}}</div><div class="hoveritem">{{name}}</div></div>',
    props: ['id', 'index', 'count', 'isactive', 'type', 'sub', 'fast_slot'],
    data: function () {
        return {
            src: './assets/images/icons/items/' + this.id + '.png',
            name: itemsData[this.id],
            ids: this.index,
            typ: this.type,
            ativ: (this.isactive == 1) ? `active` : 0,
            items: `i${this.id}a${this.isactive}`,
        }
    },
    methods: {
        select: function (event) {
            // board.sIndex = this.index;
			if(board.sType == (this.type == 'inv') ? 1 : 0){
                if(board.sIndex == this.ids){
                    context.hide()
                }else{
                    board.selectFastSlot = !1;
					board.sType = (this.type == 'inv') ? 1 : (this.type == 'out') ? 0 : 2 ;
                    board.sID = this.id;
					board.sIndex = this.ids;
					// alert(board.sIndex);
                    context.type = (this.type == 'inv') ? 1 : (this.type == 'out') ? 0 : 2 ;
                    board.context(event, itemsData[this.id], sub[this.id])
					context.fastSlot = this.fast_slot;
                }
            }else{
                board.selectFastSlot = !1;
				board.sType = (this.type == 'inv') ? 1 : (this.type == 'out') ? 0 : 2 ;
                board.sID = this.id;
				board.sIndex = this.ids;
				// alert(board.sIndex);
                context.type = (this.type == 'inv') ? 1 : (this.type == 'out') ? 0 : 2 ;
                board.context(event, itemsData[this.id], sub[this.id])
				context.fastSlot = this.fast_slot;
            }
			if (board.items[board.sIndex][0] > 0 && board.items[board.sIndex][0] < 10000) 
			{
				context.act = true;
			}
			else
			{
				context.act = false;
			}
        }
    }
})
function imgError(image) {
    image.onerror = "";
    image.src = "./assets/images/icons/items/error.svg";
    return true;
}
var board = new Vue({
    el: ".inv",
    data: {
        active: false,
        outside: false,
        outType: 0,
        outHead: "Багажник",
        stats: [1, 2, "88005553535", "Admin", 0, 0, "123456789$", "987654321$", "", 9999999, "Adamai", "Lewis", "12", "13", "100", "50"],
        items: [[-1, 5, 1],[-3, 5, 1],[-4, 5, 1],[-5, 5, 1],[-6, 5, 1],[-7, 5, 1],[-8, 5, 1],[-9, 5, 1],[-11, 5, 1],[-12, 5, 1],[-13, 5, 1],[-14, 5, 1],[5000, 5, 1], [5, 10, 0], [10, 500, 0], [11, 100, 0], [1000, 10, 0], [10, 500, 0], [11, 100, 0], [5, 10, 0], [10, 500, 0], [11, 100, 0],[114, 1, "FREEDOM"], [115, 1, "FREEDOM2"], [5, 10, 0], [10, 500, 0], [11, 100, 0], [1000, 10, 0], [10, 500, 0], [11, 100, 0], [5, 10, 0], [10, 500, 0]],
		outitems: [[11, 100, 0], [1000, 10, 0], [10, 500, 0], [11, 100, 0], [5, 10, 0], [10, 500, 0], [11, 100, 0],[114, 5, 1], [5, 10, 0], [10, 500, 0], [11, 100, 0], [1000, 10, 0], [10, 500, 0], [11, 100, 0], [5, 10, 0], [10, 500, 0]],
        sIndex: 0,
        sType: 0,
        sID: 0,
        key: 0,
		weight: 4.5,
		maxWeight: 30,
		maxWeightOut: 120,
		maxWeightBacks: 50,
		weightOut: 0,
		
		nameplayer: "Adamai Lewis",
		keys: 0,
		sFastSlot: -1,
		safeindex: [-1,-1,-1,-1,-1],
		selectFastSlot: false,
		savedFast: [undefined, undefined, undefined, undefined],
		arraymax: 0,
		counthave1: 0,
		counthave2: 0,
		counthave3: 0,
		style: 0,
		selectedcraft: null,
		selectedid: null,
		craftlist: [
		{
			id: 258,
			tr1: 612,
			tr2: 0,
			tr3: 0,
			trc1: 10,
			trc2: null,
			trc3: null,
			time: 0,
			type: "СНЕЖНАЯ",
			countcraft: 1,
		},
		{
			id: 613,
			tr1: 612,
			tr2: 0,
			tr3: 0,
			trc1: 500,
			trc2: null,
			trc3: null,
			time: 0,
			type: "СНЕЖНАЯ",
			countcraft: 1,
		},
		{
			id: 614,
			tr1: 612,
			tr2: 0,
			tr3: 0,
			trc1: 500,
			trc2: null,
			trc3: null,
			time: 0,
			type: "СНЕЖНАЯ",
			countcraft: 1,
		},
		{
			id: 615,
			tr1: 612,
			tr2: 0,
			tr3: 0,
			trc1: 1000,
			trc2: null,
			trc3: null,
			time: 0,
			type: "СНЕЖНАЯ",
			countcraft: 1,
		},
		]
    },
    methods: {
        context: function (event, name, sub) {
            if (clickInsideElement(event, 'item')) {
                context.show(event.pageX, event.pageY, name, sub)
            } else {
				context.hide()
            }
        },
        hide: function (event) {
			context.hide()
        },
        outSet: function (json) {
            this.key++
            this.outType = json[0]
            this.outHead = json[1]
            this.outitems = json[2]
			this.maxWeightOut = json[3]
            this.weightOut = json[4].toFixed(1)
        },
		gostyle: function(a) {
			this.style = a;
		},
		selectitemcraft: function(id) {
			this.selectedcraft = this.craftlist[id];
			this.selectedid = id;
			mp.trigger("client::checkitems", this.selectedid)
		},
		createobj: function() {
			if (this.selectedid == null) return;
			mp.trigger("client::createObjInv", this.selectedid)
		},
        itemsSet: function (table, json) {
            this.key++
            this.items = json
			this.weight = table.toFixed(1);
			
			this.keys = 0;
			for (let i = 0; i < this.savedFast.length; i++)
			{
				if (this.savedFast[i] != undefined)
					this.keys += 1;
			}
			
			let keys = 0;
			this.safeindex = [-1,-1,-1,-1,-1];
			
			for (let i = 0; i < this.items.length; i++)
			{
				var item = this.items[i]
				for (let t = 0; t < 6; t++)
				{
					if (this.savedFast[t] != undefined && item[0] == this.savedFast[t][0] && item[1] == this.savedFast[t][1] )
					{
						this.safeindex[t] = i;
					}
				}
				
			}
			
			for(let i = 0; i < this.safeindex.length; i++)
			{
				if (this.safeindex[i] != -1)
				{
					mp.trigger("bind", this.safeindex[i], i);
				}
			}
			
			
			if (keys != this.keys)
			{
				for (let i = 0; i < this.savedFast.length; i++)
				{
					var find = false;
					for (let t = 0; t < this.items.length; t++)
					{
						if (this.items[t][0] == this.savedFast[i][0] && this.items[t][1] == this.savedFast[i][1])
							find = true;
					}
					if (!find)
					{
						this.savedFast.splice(i, 1);
						this.savedFast[i] = undefined;
					}
				}
			}
        },
        itemUpd: function (index, data, to) {
            this.key++
            this.items[index] = data
			this.weight = to.toFixed(1);
        },
        send: function (id) {
            
            let type = (this.sType) ? 0 : this.outType
            mp.trigger('boardCB', id, type, this.sIndex)
        },
        shieldact: function (id, type, index) {
				// this.sIndex = index;
			mp.trigger('boardCB', id, type, index)
        },
		useFastSlot: function(t) 
		{
			// if (this.items[this.sIndex] > 99 && this.items[this.sIndex] < 196){
				this.savedFast[t] = this.items[this.sIndex];
				this.selectFastSlot = false;
				this.sFastSlot = t;
				// alert(this.sIndex)
				mp.trigger("bind", this.sIndex, this.sFastSlot)
			// }
        },
        unsetFastSlot: function() {
            let t = this.items[this.sIndex];
			let id = 0;
			for (let i = 0; i < this.savedFast.length; i++)
			{
				if (this.savedFast[i] != undefined && this.savedFast[i][0] == t[0] && this.savedFast[i][1] == t[1])
					id = i;
			}
            this.savedFast[id] = undefined; 
			this.key++;
			mp.trigger("unbind", id);
        }
    }
})
var context = new Vue({
    el: ".info",
    data: {
        active: false,
        style: '',
        type: true,
        name: "Ключ",
        sub: "Серийник",
		act: false,
		fastSlot: -1
    },
    methods: {
        show: function (x, y, name, sub) {
            this.style = `left:${x+25}px;top:${y}px;`
            this.name = name || "Null";
            this.sub = sub || "нет информации";
			this.active = true;
            if(sub) this.sub = sub;
            else this.sub = `нет информации`;
            let data = board.items[board.sIndex][3];
            if(data.length) this.sub += ` [${data}]`;
        },
        hide: function () {
            this.active = false;
            this.name = "";
            this.sub = "";
            board.sType = null;
            board.sID = null;
            // board.sIndex = null
        },
		setFastSlot: function() {
            this.hide(), board.selectFastSlot = true
        },
        unsetFastSlot: function() {
            this.hide(), board.unsetFastSlot()
        },
        btn: function (id) {
			if (id == 5)
			{
				this.setFastSlot();
				return;
			}
			if (id == 6)
			{
				this.unsetFastSlot();
				return;
			}
            board.send(id)
            this.hide()
        }
    }
})

var rangeslider = new Vue({
    el: ".rangeslider",
    data: {
        active: false,
        style: '',
        type: true,
        max: 100,
		count: 1,
    },
    methods: {
        btn: function () {
            mp.trigger('rangesliderboard', this.count)
        },
		exit: function () {
			this.hide()
		},
		hide: function () {
            this.active = false;
            this.max = 0;
            this.count = 0;
            board.sType = null;
            board.sID = null;
            board.sIndex = null
        },
    }
})
function clickInsideElement(e, className) {
    var el = e.srcElement || e.target;
    if (el.classList.contains(className)) {
        return el;
    } else {
        while (el = el.parentNode) {
            if (el.classList && el.classList.contains(className)) {
                return el;
            }
        }
    }
    return false;
}

DragManager.onDragCancel = function(dragObject) {
    dragObject.avatar.rollback();
};

DragManager.onDragEnd = function(dragObject, dropElem, action) {
        var sindex = $(dragObject.elem).attr('id')
        var temptype = $(dragObject.elem).data('type')
        var type;
        if(temptype == 'inv' || temptype == 'eq'){
            type = 0
        }else{
            switch(board.outHead) {
                case "Багажник":
                    type = 2;
                break;
                case "Шкаф с предметами":
                    type = 3;
                break;
                case "Шкаф с одеждой":
                    type = 4;
                break;
                case "Склад оружия":
                    type = 6;
                break;
                case "Связка ключей":
                    type = 7;
                break;
                case "Оружейный сейф":
                    type = 8;
                break;
                case "Обмен":
                    type = 8;
                break;
            }
        }
        board.shieldact(action, type, sindex)    
        dragObject.avatar.rollback();  
};